[
  {
    "name": "📧 メール作成",
    "prompt_template": "状況や作業環境をもとに、プロフェッショナルなメール案を作成してください。件名と本文を明確に分け、Markdownの見出しを使って整理してください。",
    "input_examples": "新製品リリースの案内のメール作成をしたい。",
    "output_examples": "## メール案：新製品リリースのご案内\n\n**件名：** 【新登場】画期的な新製品「SmartFocus」リリースのご案内\n\n**本文：**\n\n株式会社〇〇\n△△様\n\nいつも大変お世話になっております。株式会社〇〇の□□です。\n\nこの度、弊社では集中力を高めるための新製品「SmartFocus」をリリースいたしました。本製品は最新のAI技術を活用し、ユーザーの作業効率を最大化することを目指しております。\n\n### 製品の主な特長\n- **リアルタイム分析:** 作業パターンを自動で解析\n- **スマート通知:** 集中を妨げない最適なタイミングで休憩を提案\n- **クロスプラットフォーム対応:** PC、スマホの両方で利用可能\n\nつきましては、詳細な資料を添付いたしましたので、ぜひご一読いただけますと幸いです。ご不明な点がございましたら、お気軽にお問い合わせください。\n\n今後とも何卒よろしくお願い申し上げます。",
    "display_order": 0
  },
  {
    "name": "💡 アイデア発想",
    "prompt_template": "独創的なアイデアを複数提案してください。各アイデアにはタイトルと簡単な説明を付け、Markdownの箇条書きや見出しを使って構造化してください。",
    "input_examples": "店舗の集客を増やすためのアイデアを考えて。",
    "output_examples": "## 集客アップのための戦略的アイデア案\n\n### 1. 体験型SNSワークショップの開催\n単なる商品の販売だけでなく、商品の使い方やアレンジ方法を学べるワークショップを店内で開催します。参加者がその様子をSNSに投稿することで、自然な口コミ効果が期待できます。\n\n### 2. 「地元コラボ」限定商品の開発\n近隣の他業種（カフェ、雑貨店など）と協力し、期間限定のコラボ商品やセットメニューを開発します。お互いの顧客層を相互に送客し合う仕組みを作ります。\n\n### 3. デジタルスタンプラリーの導入\n公式LINEなどを活用したデジタルスタンプラリーを実施します。来店回数に応じた特典だけでなく、「雨の日ポイント」などのユニークな加点要素を設けて再訪を促します。",
    "display_order": 1
  },
  {
    "name": "📄 要約",
    "prompt_template": "入力された内容を、要点を絞って簡潔に要約してください。Markdownの引用（>）や箇条書きを使って、重要なポイントが一目でわかるようにしてください。",
    "input_examples": "長編小説のストーリーを簡潔にまとめたいので、要約して。",
    "output_examples": "## 作品要約：『星を追う旅人』\n\n### 概要\n主人公の少年カイトが、亡き祖父の遺した地図を頼りに伝説の島を目指す冒険譚です。旅の過程での出会いと別れを通じて、彼が精神的に成長していく姿が描かれています。\n\n### 3つの重要ポイント\n- **成長の旅:** 未知の世界への挑戦が、少年の自己発見につながる。\n- **家族の絆:** 祖父の過去を知ることで、家族の歴史と向き合う。\n- **和解と希望:** 宿敵との対決を経て、最終的には許しと共存の道を見出す。",
    "display_order": 2
  },
  {
    "name": "🛠️ 問題解決",
    "prompt_template": "提示された問題に対し、具体的な解決策をステップバイステップで提案してください。Markdownの番号付きリストやチェックボックス、表などを使って整理してください。",
    "input_examples": "人事トラブル（メンバー同士の衝突）の問題解決をしたい。",
    "output_examples": "## チーム内コンフリクト解決ガイド\n\n現在の状況を改善するための3つのステップを提案します。\n\n### ステップ1：現状の把握（ヒアリング）\n- [ ] 当事者Aから個別に事情を聴取する\n- [ ] 当事者Bから個別に事情を聴取する\n- [ ] 共通の認識と食い違っている点を整理する\n\n### ステップ2：対話の場の設定\n中立的な立場としてあなたが同席し、以下のルールで話し合いを行います。\n| 項目 | ルール内容 |\n| :--- | :--- |\n| 発言 | 相手を攻撃せず「自分」を主語に話す（Iメッセージ） |\n| 傾聴 | 相手の話を最後まで遮らずに聞く |\n| 目的 | 過去の責任追及ではなく、未来の協力体制を築く |\n\n### ステップ3：合意事項の明文化\n話し合いで決まった運用ルールをドキュメント化し、チーム全体で共有します。",
    "display_order": 3
  },
  {
    "name": "🍳 レシピ",
    "prompt_template": "状況に合わせて、美味しい料理のレシピを考案してください。Markdownの表で「材料」をまとめ、手順は箇条書きで分かりやすく記述してください。最後にワンポイントアドバイスを添えてください。",
    "input_examples": "野菜がメインで、ヘルシーな朝食のレシピが知りたい。",
    "output_examples": "## 彩り野菜のオーブン焼き：ヘルシーモーニング\n\n### 材料（1人分）\n| 材料名 | 分量 |\n| :--- | :--- |\n| 季節の野菜（ズッキーニ、パプリカ、ナス等） | 適量（計150g程度） |\n| ミニトマト | 3〜4個 |\n| 卵 | 1個 |\n| オリーブオイル | 大さじ1 |\n| 塩・コショウ | 少々 |\n\n### 作り方\n1. 野菜を一口大にカットし、耐熱容器に並べます。\n2. 全体にオリーブオイル、塩、コショウを回しかけます。\n3. 中央にスペースを作り、卵を割り落とします。\n4. 200℃に予熱したオーブン（またはトースター）で、卵が好みの固さになるまで10〜12分焼きます。\n\n> **ワンポイントアドバイス:** お好みで仕上げに粉チーズやハーブ（ローズマリー等）を散らすと、香りが引き立ち贅沢な味わいになります。",
    "display_order": 6
  }
]
